## Production: elasticache
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 12 to add, 0 to change, 6 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.redis-elasticache-high-connection-warning[0] must be replaced
  # (moved from aws_cloudwatch_metric_alarm.redis-elasticache-high-connection-warning)
-/+ resource "aws_cloudwatch_metric_alarm" "redis-elasticache-high-connection-warning" {
      ~ alarm_name                            = "redis-elasticache-high-connection-warning" -> "redis-elasticache-high-connection-warning-CacheCluster001" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:ca-central-1:296255494825:alarm:redis-elasticache-high-connection-warning" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      ~ dimensions                            = {
          ~ "CacheClusterId" = "notification-canada-ca-production-cluster-cache" -> "notify-production-cluster-cache-az-001"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "redis-elasticache-high-connection-warning" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.redis-elasticache-high-connection-warning[1] will be created
  + resource "aws_cloudwatch_metric_alarm" "redis-elasticache-high-connection-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "Average Number of Connections on Redis ElastiCache >= 1000 connections during 1 minute"
      + alarm_name                            = "redis-elasticache-high-connection-warning-CacheCluster002"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "notify-production-cluster-cache-az-002"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CurrConnections"
      + namespace                             = "AWS/ElastiCache"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 1000
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.redis-elasticache-high-connection-warning[2] will be created
  + resource "aws_cloudwatch_metric_alarm" "redis-elasticache-high-connection-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "Average Number of Connections on Redis ElastiCache >= 1000 connections during 1 minute"
      + alarm_name                            = "redis-elasticache-high-connection-warning-CacheCluster003"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "notify-production-cluster-cache-az-003"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CurrConnections"
      + namespace                             = "AWS/ElastiCache"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 1000
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.redis-elasticache-high-cpu-warning[0] must be replaced
  # (moved from aws_cloudwatch_metric_alarm.redis-elasticache-high-cpu-warning)
-/+ resource "aws_cloudwatch_metric_alarm" "redis-elasticache-high-cpu-warning" {
      ~ alarm_description                     = "Average CPU of Redis ElastiCache >= 70% during 1 minute" -> "Average CPU of Redis ElastiCache >= 70% during 1 minute "
      ~ alarm_name                            = "redis-elasticache-high-cpu-warning" -> "redis-elasticache-high-cpu-warning-CacheCluster001CPUUtilization" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:ca-central-1:296255494825:alarm:redis-elasticache-high-cpu-warning" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      ~ dimensions                            = {
          ~ "CacheClusterId" = "notification-canada-ca-production-cluster-cache" -> "notify-production-cluster-cache-az-001"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "redis-elasticache-high-cpu-warning" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.redis-elasticache-high-cpu-warning[1] will be created
  + resource "aws_cloudwatch_metric_alarm" "redis-elasticache-high-cpu-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "Average CPU of Redis ElastiCache >= 70% during 1 minute "
      + alarm_name                            = "redis-elasticache-high-cpu-warning-CacheCluster002CPUUtilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "notify-production-cluster-cache-az-002"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ElastiCache"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 70
      + treat_missing_data                    = "breaching"
    }

  # aws_cloudwatch_metric_alarm.redis-elasticache-high-cpu-warning[2] will be created
  + resource "aws_cloudwatch_metric_alarm" "redis-elasticache-high-cpu-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "Average CPU of Redis ElastiCache >= 70% during 1 minute "
      + alarm_name                            = "redis-elasticache-high-cpu-warning-CacheCluster003CPUUtilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "notify-production-cluster-cache-az-003"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ElastiCache"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 70
      + treat_missing_data                    = "breaching"
    }

  # aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-warning[0] must be replaced
  # (moved from aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-warning)
-/+ resource "aws_cloudwatch_metric_alarm" "redis-elasticache-high-db-memory-warning" {
      ~ alarm_name                            = "redis-elasticache-high-db-memory-warning" -> "redis-elasticache-high-db-memory-warning-CacheCluster001" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:ca-central-1:296255494825:alarm:redis-elasticache-high-db-memory-warning" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      ~ dimensions                            = {
          ~ "CacheClusterId" = "notification-canada-ca-production-cluster-cache" -> "notify-production-cluster-cache-az-001"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "redis-elasticache-high-db-memory-warning" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-warning[1] will be created
  + resource "aws_cloudwatch_metric_alarm" "redis-elasticache-high-db-memory-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "Average DB Memory on Redis ElastiCache >= 60% during 1 minute"
      + alarm_name                            = "redis-elasticache-high-db-memory-warning-CacheCluster002"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "notify-production-cluster-cache-az-002"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "DatabaseMemoryUsagePercentage"
      + namespace                             = "AWS/ElastiCache"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 60
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-warning[2] will be created
  + resource "aws_cloudwatch_metric_alarm" "redis-elasticache-high-db-memory-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "Average DB Memory on Redis ElastiCache >= 60% during 1 minute"
      + alarm_name                            = "redis-elasticache-high-db-memory-warning-CacheCluster003"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "notify-production-cluster-cache-az-003"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "DatabaseMemoryUsagePercentage"
      + namespace                             = "AWS/ElastiCache"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 60
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.redis-elasticache-medium-cpu-warning[0] must be replaced
  # (moved from aws_cloudwatch_metric_alarm.redis-elasticache-medium-cpu-warning)
-/+ resource "aws_cloudwatch_metric_alarm" "redis-elasticache-medium-cpu-warning" {
      ~ alarm_name                            = "redis-elasticache-medium-cpu-warning" -> "redis-elasticache-medium-cpu-warning-CacheCluster001CPUUtilization" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:ca-central-1:296255494825:alarm:redis-elasticache-medium-cpu-warning" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      ~ dimensions                            = {
          ~ "CacheClusterId" = "notification-canada-ca-production-cluster-cache" -> "notify-production-cluster-cache-az-001"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "redis-elasticache-medium-cpu-warning" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.redis-elasticache-medium-cpu-warning[1] will be created
  + resource "aws_cloudwatch_metric_alarm" "redis-elasticache-medium-cpu-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "Average CPU of Redis ElastiCache >= 50% during 1 minute"
      + alarm_name                            = "redis-elasticache-medium-cpu-warning-CacheCluster002CPUUtilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "notify-production-cluster-cache-az-002"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ElastiCache"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "breaching"
    }

  # aws_cloudwatch_metric_alarm.redis-elasticache-medium-cpu-warning[2] will be created
  + resource "aws_cloudwatch_metric_alarm" "redis-elasticache-medium-cpu-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "Average CPU of Redis ElastiCache >= 50% during 1 minute"
      + alarm_name                            = "redis-elasticache-medium-cpu-warning-CacheCluster003CPUUtilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "notify-production-cluster-cache-az-003"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ElastiCache"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "breaching"
    }

  # aws_elasticache_cluster.notification-cluster-cache will be destroyed
  # (because aws_elasticache_cluster.notification-cluster-cache is not in configuration)
  - resource "aws_elasticache_cluster" "notification-cluster-cache" {
      - apply_immediately        = true -> null
      - arn                      = "arn:aws:elasticache:ca-central-1:296255494825:cluster:notification-canada-ca-production-cluster-cache" -> null
      - availability_zone        = "ca-central-1d" -> null
      - az_mode                  = "single-az" -> null
      - cache_nodes              = [
          - {
              - address           = "notification-canada-ca-production-cluster-cache.y7zahu.0001.cac1.cache.amazonaws.com"
              - availability_zone = "ca-central-1d"
              - id                = "0001"
              - port              = 6379
            },
        ] -> null
      - cluster_id               = "notification-canada-ca-production-cluster-cache" -> null
      - engine                   = "redis" -> null
      - engine_version           = "6.x" -> null
      - engine_version_actual    = "6.2.6" -> null
      - id                       = "notification-canada-ca-production-cluster-cache" -> null
      - maintenance_window       = "thu:04:00-thu:05:00" -> null
      - node_type                = "cache.t3.micro" -> null
      - num_cache_nodes          = 1 -> null
      - parameter_group_name     = "default.redis6.x" -> null
      - port                     = 6379 -> null
      - security_group_ids       = [
          - "sg-09e3175f46bc85607",
        ] -> null
      - security_group_names     = [] -> null
      - snapshot_retention_limit = 0 -> null
      - snapshot_window          = "02:00-03:00" -> null
      - subnet_group_name        = "notification-canada-ca-production-cache-subnet" -> null
      - tags                     = {
          - "CostCenter" = "notification-canada-ca-production"
        } -> null
      - tags_all                 = {
          - "CostCenter" = "notification-canada-ca-production"
        } -> null
    }

  # aws_elasticache_cluster.notification-cluster-cache-multiaz-group-replica will be destroyed
  # (because aws_elasticache_cluster.notification-cluster-cache-multiaz-group-replica is not in configuration)
  - resource "aws_elasticache_cluster" "notification-cluster-cache-multiaz-group-replica" {
      - arn                      = "arn:aws:elasticache:ca-central-1:296255494825:cluster:notification-canada-ca-production-cluster-cache-az" -> null
      - availability_zone        = "ca-central-1b" -> null
      - az_mode                  = "single-az" -> null
      - cache_nodes              = [
          - {
              - address           = "notification-canada-ca-production-cluster-cache-az.y7zahu.0001.cac1.cache.amazonaws.com"
              - availability_zone = "ca-central-1b"
              - id                = "0001"
              - port              = 6379
            },
        ] -> null
      - cluster_id               = "notification-canada-ca-production-cluster-cache-az" -> null
      - engine                   = "redis" -> null
      - engine_version           = "6.x" -> null
      - engine_version_actual    = "6.2.6" -> null
      - id                       = "notification-canada-ca-production-cluster-cache-az" -> null
      - maintenance_window       = "thu:04:00-thu:05:00" -> null
      - node_type                = "cache.t3.micro" -> null
      - num_cache_nodes          = 1 -> null
      - parameter_group_name     = "default.redis6.x" -> null
      - port                     = 6379 -> null
      - replication_group_id     = "notify-production-cluster-cache-az" -> null
      - security_group_ids       = [
          - "sg-09e3175f46bc85607",
        ] -> null
      - security_group_names     = [] -> null
      - snapshot_retention_limit = 0 -> null
      - snapshot_window          = "23:00-00:00" -> null
      - subnet_group_name        = "notification-canada-ca-production-cache-subnet" -> null
      - tags                     = {} -> null
      - tags_all                 = {} -> null
    }

Plan: 12 to add, 0 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-connection-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-connection-warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-connection-warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-cpu-warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-cpu-warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-medium-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-medium-cpu-warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-medium-cpu-warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_replication_group.notification-cluster-cache-multiaz-group"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.notification-canada-ca-cache-subnet"]

31 tests, 17 passed, 14 warnings, 0 failures, 0 exceptions

```

</details>
